[
  {
    "id": "08af6705",
    "badge": "NEW",
    "title": "Monocyte Backpack Delivery of Engineered MCF-7 Exosomes for the Treatment of Early Stage Type 1 Diabetes.",
    "summary": "Type 1 diabetes mellitus (T1DM) is a chronic immune system disorder characterized by immune system-mediated destruction of pancreatic β-cells through cytotoxic T lymphocyte infiltration, leading to absolute insulin deficiency. Supplementation of exogenous insulin can't protect remaining β-cells or address...",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "This research paper presents new findings about Type 1 Diabetes. Scientists are constantly learning more about how the disease works and how to treat it better. This research contributes to our overall understanding and may lead to new treatment options in the future."
    },
    "meta": {
      "published": "20 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "MEDIUM"
    },
    "link": "https://pubmed.ncbi.nlm.nih.gov/41116608/"
  },
  {
    "id": "0360505b",
    "badge": "NEW",
    "title": "Evaluating diabetes care processes, comorbidity burden and continuous glucose monitoring utilisation in regional Australia: results from Central Queensland Hospital.",
    "summary": "Real-world adherence to guideline-recommended diabetes care in regional Australia is poorly described. This study aimed to evaluate adherence to diabetes care processes, comorbidity burden and continuous blood sugar monitoring (CGM) metrics among individuals with type 1 diabetes (T1D) attending a region...",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "This research paper presents new findings about Type 1 Diabetes. Scientists are constantly learning more about how the disease works and how to treat it better. This research contributes to our overall understanding and may lead to new treatment options in the future."
    },
    "meta": {
      "published": "25 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "MEDIUM"
    },
    "link": "https://pubmed.ncbi.nlm.nih.gov/41137611/"
  },
  {
    "id": "8b696105",
    "badge": "NEW",
    "title": "Transition to Adult Care in Youth with Type 1 Diabetes: Follow-Up Continuity, Complications, and Metabolic Control.",
    "summary": "The transition from pediatric to adult care in individuals with Type 1 Diabetes (T1D) often presents significant challenges, including disruptions in follow-up continuity and metabolic control.",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "This research paper presents new findings about Type 1 Diabetes. Scientists are constantly learning more about how the disease works and how to treat it better. This research contributes to our overall understanding and may lead to new treatment options in the future."
    },
    "meta": {
      "published": "27 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "MEDIUM"
    },
    "link": "https://pubmed.ncbi.nlm.nih.gov/41143600/"
  }
]