[
  {
    "id": "1753f6d8",
    "badge": "NEW",
    "title": "Development of a Diabetes Rural Stakeholder Research Team and Patient-Centered Research Agenda.",
    "summary": "This research tested new treatment approaches in Type 1 Diabetes. The findings could contribute to better understanding and treatment of the disease.",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "This research adds to our scientific understanding of Type 1 Diabetes. While not every study leads to immediate treatments, each piece of knowledge helps researchers develop better therapies. Breakthroughs often come from connecting insights across many different studies like this one."
    },
    "meta": {
      "published": "23 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "MEDIUM",
      "stage": "Early Research",
      "research_type": "Research"
    },
    "link": "https://pubmed.ncbi.nlm.nih.gov/41127954/",
    "special": false,
    "excitement_rank": 999
  },
  {
    "id": "8b696105",
    "badge": "NEW",
    "title": "Transition to Adult Care in Youth with Type 1 Diabetes: Follow-Up Continuity, Complications, and Metabolic Control.",
    "summary": "This research focuses on what happens when young people with Type 1 Diabetes move from pediatric care to adult care. It's studying how to make this transition smoother and keep people healthy during this important life change.",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "Moving from pediatric to adult diabetes care is a critical time. Young adults often struggle with maintaining good blood sugar control during this transition. This research helps us understand what goes wrong and how to better support people during this change. Better transition care means fewer complications and hospitalizations during this vulnerable period."
    },
    "meta": {
      "published": "27 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "MEDIUM",
      "stage": "Early Research",
      "research_type": "Research"
    },
    "link": "https://pubmed.ncbi.nlm.nih.gov/41143600/",
    "special": false,
    "excitement_rank": 999
  }
]