[
  {
    "id": "df1d45b7",
    "badge": "BREAKING",
    "title": "New Therapy After Islet Cell Transplant Shows Promise for People with Type 1 Diabetes",
    "summary": "A new monoclonal antibody therapy called tegoprubart is being tested at the University of Chicago Medicine Transplant Institute to improve outcomes for islet cell transplants in Type 1 diabetes patients. Early results show promise in achieving insulin independence without traditional immunosuppressive drugs.",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "This exciting news from ABC News brings hope and important updates for families managing Type 1 Diabetes. Stay informed about the latest developments that could impact your daily life and future treatment options."
    },
    "meta": {
      "published": "28 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "HIGH",
      "stage": "Clinical Trials",
      "research_type": "Treatment"
    },
    "link": "https://abcnews.go.com/GMA/Wellness/new-therapy-after-islet-cell-transplant-shows-promise/story?id=115230952",
    "special": true,
    "excitement_rank": 1,
    "published_timestamp": 1761620992.007983
  },
  {
    "id": "3feda5d8",
    "badge": "BREAKING",
    "title": "Breakthrough T1D Announces Publication of Two Peer-Reviewed Articles on Type 1 Diabetes Burdens",
    "summary": "Breakthrough T1D published two articles emphasizing the ongoing challenges faced by individuals with Type 1 diabetes and the urgent need for innovative therapies, including cell-based treatments, to alleviate these burdens.",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "This exciting news from Breakthrough T1D brings hope and important updates for families managing Type 1 Diabetes. Stay informed about the latest developments that could impact your daily life and future treatment options."
    },
    "meta": {
      "published": "28 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "HIGH",
      "stage": "Research",
      "research_type": "Awareness"
    },
    "link": "https://www.breakthrought1d.org/for-the-media/press-releases/breakthrough-t1d-announces-the-publication-of-two-peer-reviewed-articles-that-expand-insight-into-the-burdens-of-living-with-type-1-diabetes/",
    "special": true,
    "excitement_rank": 2,
    "published_timestamp": 1761617392.007983
  },
  {
    "id": "b9ad7ba8",
    "badge": "BREAKING",
    "title": "Top 5 Most-Read Type 1 Diabetes Articles of 2023 Highlight Key Advancements",
    "summary": "The American Journal of Managed Care compiled the most-read articles on Type 1 diabetes from 2023, covering topics such as advancements in treatment, management strategies, and patient experiences.",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "This exciting news from American Journal of Managed Care brings hope and important updates for families managing Type 1 Diabetes. Stay informed about the latest developments that could impact your daily life and future treatment options."
    },
    "meta": {
      "published": "28 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "MEDIUM",
      "stage": "Research",
      "research_type": "Review"
    },
    "link": "https://www.ajmc.com/view/top-5-most-read-type-1-diabetes-articles-of-2023",
    "special": true,
    "excitement_rank": 3,
    "published_timestamp": 1761613792.007983
  }
]