[
  {
    "id": "08af6705",
    "badge": "NEW",
    "title": "Monocyte Backpack Delivery of Engineered MCF-7 Exosomes for the Treatment of Early Stage Type 1 Diabetes.",
    "summary": "Type 1 diabetes mellitus (T1DM) is a chronic immune system disorder characterized by immune system-mediated destruction of pancreatic β-cells through cytotoxic T lymphocyte infiltration, leading to absolute insulin deficiency. Supplementation of exogenous insulin can't protect remaining β-cells or address...",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "This research paper presents new findings about Type 1 Diabetes. Scientists are constantly learning more about how the disease works and how to treat it better. This research contributes to our overall understanding and may lead to new treatment options in the future."
    },
    "meta": {
      "published": "20 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "MEDIUM"
    },
    "link": "https://pubmed.ncbi.nlm.nih.gov/41116608/"
  },
  {
    "id": "87797056",
    "badge": "NEW",
    "title": "One-year effectiveness and safety in young children aged 2-6 years with type 1 diabetes using an automated insulin delivery system: A real-world prospective cohort study.",
    "summary": "This study evaluated 1-year real-world changes in glycaemic management, parent-reported outcomes and safety with an automated insulin delivery (AID) system in young children with type 1 diabetes (T1D).",
    "details": {
      "heading": "🔬 What This Means for Families:",
      "content": "This research paper presents new findings about Type 1 Diabetes. Scientists are constantly learning more about how the disease works and how to treat it better. This research contributes to our overall understanding and may lead to new treatment options in the future."
    },
    "meta": {
      "published": "27 Oct 2025",
      "phase": "Research",
      "status": "Published",
      "priority": "MEDIUM"
    },
    "link": "https://pubmed.ncbi.nlm.nih.gov/41144887/"
  }
]